AUTO_config_TK_pesok/src/Documents/ТК_КорректировкаДолга/ТК_КорректировкаДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТК_КорректировкаДолга</name>
  <comment>Корректировка долга</comment>
  <basedOn>Document.ВозвратОтПокупателя</basedOn>
  <basedOn>Document.ВозвратПоставщику</basedOn>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателямиПоДокументам</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентированныйУчет</name>
    <comment>Флаг отражения документа в регламентированном учете</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Поставщик/комитент от которого мы получили товар</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаПриход</name>
    <comment>Сумма увеличения долга контрагента</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаРасход</name>
    <comment>Сумма уменьшения долга контрагента</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс валюты документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДохода</name>
    <comment>Статья доходов по начислению задолженности</comment>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасхода</name>
    <comment>Статья расходов по списанию задолженности</comment>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ВозвратПоставщику</types>
      <types>DocumentRef.ВозвратОтПокупателя</types>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <comment>Состав корректируемых долгов по договорам и сделкам</comment>
    <attributes>
      <name>ДоговорВзаиморасчетов</name>
      <comment>Договор, по которому ведутся взаиморасчеты с контрагентом</comment>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <comment>Сделка, по которой корректируется долг</comment>
      <type>
        <types>DefinedType.ТипыСделок</types>
      </type>
    </attributes>
    <attributes>
      <name>УвеличениеДолга</name>
      <comment>Сумма, на которую надо увеличить долг контрагента</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УменьшениеДолга</name>
      <comment>Сумма, на которую надо уменьшить долг контрагента</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Enums/ВидыДоговоров/ВидыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоров</name>
  <comment>Виды договоров</comment>
  <enumValues>
    <name>Покупка</name>
    <comment>Договоры с поставщиками</comment>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
    <comment>Договоры с покупателями</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
    <comment>Договор комиссии</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
    <comment>Договор начисления бонусов</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Общий договор</comment>
  </enumValues>
  <enumValues>
    <name>УпрощеннаяКомиссия</name>
    <comment>Упрощенная комиссия</comment>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Бартерный</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Enums/ВидыОперацийВзаиморасчетов/ВидыОперацийВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийВзаиморасчетов</name>
  <comment>Виды операций взаиморасчетов</comment>
  <enumValues>
    <name>НачислениеДебиторскойЗадолженности</name>
    <comment>Начисление дебиторской задолженности</comment>
  </enumValues>
  <enumValues>
    <name>ПогашениеКредиторскойЗадолженности</name>
    <comment>Погашение кредиторской задолженности</comment>
  </enumValues>
  <enumValues>
    <name>НачислениеКредиторскойЗадолженности</name>
    <comment>Начисление кредиторской задолженности</comment>
  </enumValues>
  <enumValues>
    <name>ПогашениеДебиторскойЗадолженности</name>
    <comment>Погашение дебиторской задолженности</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеКурсовойРазницыБазВалюты</name>
  </enumValues>
  <enumValues>
    <name>СписаниеКурсовойРазницыУпрВалюты</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Documents/ТК_КорректировкаДолга/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка,ДополнительныеСвойства);

	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаВтТаблицаСостав(Запрос, ТекстыЗапроса);
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);					
	ПартионныйУчет.ПодготовитьТаблицыКорректировокДолга(Запрос,ДополнительныеСвойства);

КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка,ДополнительныеСвойства)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Док.Дата КАК Период,
	               |	Док.Ссылка КАК Ссылка,
	               |	Док.ХозОперация КАК ХозОперация,
	               |	Док.Организация КАК Организация,
	               |	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	Док.ТорговаяПлощадка КАК ТорговаяПлощадка,
	               |	Док.ВалютаДокумента КАК ВалютаДокумента,
	               |	Док.МоментВремени КАК МоментВремени,
	               |	Док.КурсДокумента КАК КурсДокумента,
	               |	Док.СуммаДокументаПриход КАК СуммаДокументаПриход,
   	               |	Док.СуммаДокументаРасход КАК СуммаДокументаРасход,
	               |	Док.РегламентированныйУчет КАК РегламентированныйУчет
	               |ИЗ
	               |	Документ.ТК_КорректировкаДолга КАК Док
	               |ГДЕ
	               |	Док.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период", 			Реквизиты.Период);
	Запрос.УстановитьПараметр("МоментВремени", 		Реквизиты.МоментВремени);
	Запрос.УстановитьПараметр("Ссылка", 			Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("КурсДокумента", 		Реквизиты.КурсДокумента);
	Запрос.УстановитьПараметр("ВалютаДокумента",	Реквизиты.ВалютаДокумента);
	Запрос.УстановитьПараметр("ХозОперация", 		Реквизиты.ХозОперация);
	Запрос.УстановитьПараметр("РегламентированныйУчет", Реквизиты.РегламентированныйУчет);	
	Запрос.УстановитьПараметр("ТипДоговораПокупка", Перечисления.ВидыДоговоров.Покупка);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);	
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);	

	Запрос.УстановитьПараметр("ВидОперацииПДЗ", Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности);	
	Запрос.УстановитьПараметр("ВидОперацииПКЗ", Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности);	
	
КонецПроцедуры

Функция ТекстЗапросаВтТаблицаСостав(Запрос, ТекстыЗапроса)
	
	
	ИмяРегистра = "ВтТаблицаСостав";
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СоставДокумента.ДоговорВзаиморасчетов.Контрагент КАК Контрагент,
	               |	СоставДокумента.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	               |	СоставДокумента.ДоговорВзаиморасчетов.ВидДоговора.ВидДоговора КАК ТипДоговора,
	               |	СоставДокумента.УвеличениеДолга КАК УвеличениеДолга,
	               |	СоставДокумента.УменьшениеДолга КАК УменьшениеДолга,
	               |	СоставДокумента.Сделка КАК Сделка
	               |ПОМЕСТИТЬ ВтТаблицаСостав
	               |ИЗ
	               |	Документ.ТК_КорректировкаДолга.Состав КАК СоставДокумента
	               |ГДЕ
	               |	СоставДокумента.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти


#Область Последовательность

Процедура ИнициалзироватьДанныеПоследовательности(Ссылка,ДополнительныеСвойства) Экспорт
	
	ТаблицыДляПоследовательности = Новый Структура("Взаиморасчеты");	
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	&Дата КАК Период,
	                      |	ТК_КорректировкаДолгаСостав.Ссылка КАК Регистратор,
	                      |	ТК_КорректировкаДолгаСостав.ДоговорВзаиморасчетов КАК ДоговорКонтрагента
	                      |ИЗ
	                      |	Документ.ТК_КорректировкаДолга.Состав КАК ТК_КорректировкаДолгаСостав
	                      |ГДЕ
	                      |	ТК_КорректировкаДолгаСостав.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", ДополнительныеСвойства.ДляПроведения.Дата); 
		
	ТаблицыДляПоследовательности.Взаиморасчеты = Запрос.Выполнить().Выгрузить();
	
	ДополнительныеСвойства.Вставить("ТаблицыДляПоследовательности",ТаблицыДляПоследовательности);
	
КонецПроцедуры

#КонецОбласти	


#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	                                            
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ПодразделениеКомпании)
	|	И ЗначениеРазрешено(ТорговаяПлощадка)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти	


#КонецЕсли
